[Reference](https://medium.com/datadriveninvestor/using-pandas-shift-function-764df8c5dfcf)

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'A': [10, 20, 30, 40, 50],
                   'B': [11, 21, 31, 41, 51],
                   'C': [45, 90, 135, 180, 225]})

In [3]:
df.head()

    A   B    C
0  10  11   45
1  20  21   90
2  30  31  135
3  40  41  180
4  50  51  225

In [4]:
df.shift(periods=1)

      A     B      C
0   NaN   NaN    NaN
1  10.0  11.0   45.0
2  20.0  21.0   90.0
3  30.0  31.0  135.0
4  40.0  41.0  180.0

In [5]:
df['A_shift'] = df['A'].shift(1)

In [6]:
df

    A   B    C  A_shift
0  10  11   45      NaN
1  20  21   90     10.0
2  30  31  135     20.0
3  40  41  180     30.0
4  50  51  225     40.0

In [7]:
df.shift(-1)

      A     B      C  A_shift
0  20.0  21.0   90.0     10.0
1  30.0  31.0  135.0     20.0
2  40.0  41.0  180.0     30.0
3  50.0  51.0  225.0     40.0
4   NaN   NaN    NaN      NaN

In [9]:
df.shift(periods=1, axis='columns')

    A     B     C  A_shift
0 NaN  10.0  11.0      NaN
1 NaN  20.0  21.0      NaN
2 NaN  30.0  31.0      NaN
3 NaN  40.0  41.0      NaN
4 NaN  50.0  51.0      NaN

In [10]:
df.shift(periods=1, axis='index')

      A     B      C  A_shift
0   NaN   NaN    NaN      NaN
1  10.0  11.0   45.0      NaN
2  20.0  21.0   90.0     10.0
3  30.0  31.0  135.0     20.0
4  40.0  41.0  180.0     30.0

In [11]:
df.shift(periods=2, fill_value=0)

    A   B    C  A_shift
0   0   0    0      0.0
1   0   0    0      0.0
2  10  11   45      NaN
3  20  21   90     10.0
4  30  31  135     20.0

In [12]:
df['C_shift'] = df['C'].shift(periods=2, fill_value=10)
df

    A   B    C  A_shift  C_shift
0  10  11   45      NaN       10
1  20  21   90     10.0       10
2  30  31  135     20.0       45
3  40  41  180     30.0       90
4  50  51  225     40.0      135